soaplab/src/xml-ref/category.xml

<?xml version="1.0" encoding="utf-8"?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope"> 
 <env:Header>
  <liq:Header xmlns:liq="http://savonet.sf.net/ns/message-type" 
      env:role="http://www.w3.org/2003/05/soap-envelope/role/next"
      env:mustUnderstand="true">
   <liq:message-type>
    <liq:content-type>application/xspf+xml</liq:content-type>
    <liq:role>http://savonet.sf.net/message/role/category-contents</liq:role>
   </liq:message-type>
   <liq:dateTime>2007-07-12T19:21:04.603+02:00</liq:dateTime>
   <liq:sender>
    <liq:server>eratosthene</liq:server>
   </liq:sender>
  </liq:Header>
 </env:Header>
 <env:Body>
  <xspf:playlist xspf:version="1" xmlns:xspf="http://xspf.org/ns/0/">
   <xspf:title>Golds</xspf:title>
   <xspf:trackList>
    <xspf:track>
     <xspf:title>Moi Lolita</xspf:title>
     <xspf:creator>Alizée</xspf:creator>
     <xspf:duration>212000</xspf:duration>
     <xspf:info>metadata.xml</xspf:info>
     <xspf:location>ftp://eratosthene:5679/music/2/4/241889e2c658756c0b58db8d32f25d90b9bc514a.ogg</xspf:location>
    </xspf:track>
    <xspf:track>
     <xspf:title>I'm so excited</xspf:title>
     <xspf:creator>Pointer Sisters</xspf:creator>
     <xspf:duration>165000</xspf:duration>
     <xspf:location>ftp://eratosthene:5676/music/8/f/8fc752c103ff4e42355117ca92f5367e7c4b7798.ogg</xspf:location>
    </xspf:track>
    <xspf:track>
     <xspf:title>Enjoy the silence</xspf:title>
     <xspf:creator>Depeche Mode</xspf:creator>
     <xspf:duration>265500</xspf:duration>
     <xspf:location>http://localhost/d46d9bd0db17266de0ebdfa7f12e0c4c63fe374b.ogg</xspf:location>
    </xspf:track>
    <xspf:track>
     <xspf:title>Haunting Bells</xspf:title>
     <xspf:creator>Cold Colours</xspf:creator>
     <xspf:duration>178000</xspf:duration>
     <xspf:info>metadata-2.xml</xspf:info>
     <xspf:location>http://www.dolebrai.net/playlist/morceau/fichier/haunting-bells-cold-colours/</xspf:location>
    </xspf:track>
    <!-- ... -->
   </xspf:trackList>
  </xspf:playlist>
 </env:Body>
</env:Envelope>
